// 변수 이름(Variable name) = 식별자(Identifier)

// 변수 이름 규칙! ✨
// 1. 저장된 값을 잘 나타낼 수 있는 의미 있는 이름 -> 구체적일 수록 좋다.
// 2. 라틴 문자(0-9, a-z, A-Z)
// 3. 대소문자 구분 (추천 : camelCase)
// 4. 한국어 ❌
// 5. 예약어 ❌
// 6. 숫자로 시작 ❌
// 7. 특수문자, 이모지 ❌ (_, $ 는 예외)
// 8. 여러 개의 변수를 1, 2, 3 숫자로 구분 ❌ -> 최대한 의미 있게, 구체적으로 작성!

// let variableName
// const variableName

let apple;
let redApple;

// 나쁜 예제 👎
// 변수의 이름만으로 아무것도 알 수 없는 경우
let num = 20;
// 여러 개의 변수를 1, 2, ... 를 붙여 구분하는 경우
let audio1;
let audio2;

// 좋은 예제 👍
// 변수의 이름만으로 의미를 알 수 있는 경우
let myAge = 20;
// 여러 개의 변수를 구체적으로 구분하는 경우
let backgroundAudio;
let windAudio;

// 꿀팁! 🍯
// 구체적인 사항은 뒤로! -> 위치를 일정하게!
let audioBackground;
let audioWind;
